package OOP.Lec1;

public class Theory {
    
}

/*
ООП – объектно-ориентированное программирование.
 * Парадигма (стиль, шаблон) разработки ПО, основными понятиями которой являются классы и объекты. 
 * Говорят, что разработка в стиле ООП ведется с использованием классов объектов, 
 * которые обладают состоянием и поведением, зависящим от этого состояния.
 * 
Ex 04 : 
Инкапсуляция – это свойство системы, 
позволяющее объединить данные и методы, работающие с ними в классе, скрыв детали реализации и защитив
от пользователя этого класса объектов.

Ex 05 : not the best example as the code for magician and priest pretty much repeats itself. 
Ex 06 : applied principles of inheritance 
Наследование – это свойство системы, позволяющее описать новый класс на основе уже существующего, 
с частично или полностью заимствующейся функциональностью.
Класс, от которого производится наследование, называется базовым или родительским.
Новый класс – потомком, наследником или производным классом.

Ex 07 :
Полиморфизм – это свойство системы, использовать объекты с одинаковым интерфейсом без информации 
о типе и внутренней структуре объекта.
Полиморфизм - способность использовать объект вне зависимости от его реализации, благодаря, 
полиморфной переменной – это переменная, которая может принимать значения разных типов.

 */